Examples/old_cases/parametricSweepHartmanFlow/hartmann/0/B
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 -1 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            zeroGradient;
        //value           uniform (0 0 0);
    }
    inlet
    {
        type            zeroGradient;
        //value           uniform (0 0 0);
    }
    ".*"
    {
        type            fixedValue;
        value           uniform (0 20 0);
    }
}


// ************************************************************************* //
